---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookBottomDirn2
source: html/edc8d9d7-f292-004a-b049-3b17af4e4079.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanhookBottomDirn2 Property

"Hook Angle Bottom"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpanhookBottomDirn2 { get; }
```